{"addonId": "NativeSpeechGeneration", "displayName": "Native Speech Generation", "URL": "https://github.com/muhammadGagah/native-speech-generation/releases/download/v1.5.3/NativeSpeechGeneration-1.5.3.nvda-addon", "description": "Manfaatkan kekuatan AI Gemini canggih dari Google untuk menghasilkan suara berkualitas tinggi langsung di dalam NVDA.\nAdd-on ini menyediakan dialog yang ramah pengguna untuk mengubah teks menjadi audio yang terdengar alami.\n\nFitur Utama:\n- Suara Berkualitas Tinggi: Pilih antara Gemini Pro untuk suara premium yang mirip dengan kehidupan nyata dan Gemini Flash untuk kualitas standar yang responsif.\n\n- Mode Satu dan Multi-Pembicara: Dengan mudah hasilkan audio untuk satu pembicara atau buat dialog dinamis dengan dua pembicara yang berbeda. Cukup format teks Anda dengan \"NamaPembicara:\" untuk menetapkan suara.\n\n- Kontrol Suara Lanjutan: Sesuaikan output dengan mengatur temperature untuk hasil yang lebih kreatif atau stabil, dan berikan instruksi gaya pembicara sesuai keinginan.\n\n- Antarmuka yang Dapat Diakses: Semua kontrol sepenuhnya dapat diakses, termasuk panel yang dapat diciutkan untuk pengaturan lanjutan agar antarmuka tetap bersih dan mudah dinavigasi.\n\n- Alur Kerja yang Lancar: Add-on ini menyediakan pemutaran audio instan setelah pembuatan dan memungkinkan Anda menyimpan file .wav yang dihasilkan untuk digunakan nanti.\nUntuk memulai, dapatkan kunci API Gemini dari Google AI Studio dan masukkan ke dalam panel pengaturan add-on, yang dapat ditemukan di menu Alat NVDA.", "sha256": "9cc181399d3a8ea850ecf55175dbb4e0a05342723710e0e72408878b283b8c7f", "addonVersionName": "1.5.3", "addonVersionNumber": {"major": 1, "minor": 5, "patch": 3}, "minNVDAVersion": {"major": 2024, "minor": 1, "patch": 0}, "lastTestedVersion": {"major": 2025, "minor": 3, "patch": 2}, "channel": "stable", "publisher": "Muhammad", "sourceURL": "https://github.com/muhammadGagah/native-speech-generation", "license": "GPL v2", "homepage": "https://github.com/muhammadGagah/native-speech-generation/", "changelog": "- Code Refactoring: Complies with NVDA coding standards (Tabs, CamelCase).\n- Optimized Update: Preserves library files to avoid redownloading data.\n- Improved UX: Restored device selection in \"Talk With AI\", better button states, and fixed dialog closing behavior.\n- Fix: Resolved namespace conflicts and ensured proper stream cancellation.\n", "licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html", "submissionTime": 1769495384000}