{"addonId": "robEnhancements", "displayName": "Vylepšení ROB", "URL": "https://github.com/RainerBrell/robEnhancements/releases/download/2025.08.13b/robEnhancements-2025.08.13b.nvda-addon", "description": "Toto rozšíření přidává novou funkcionalitu do aplikací a poskytuje globální nápovědu:\n\nPokud je ve Windows Exploreru nebo Total Commanderu vybrán soubor Markdown (*.md):\n\nNVDA+Alt+Mezera – zobrazí soubor v prohlížeči NVDA.\nNVDA+Alt+Shift+Mezera – uloží soubor ve formátu HTML.\n\nVe všech prohlížečích:\n\nNVDA+Ctrl+F4 – zobrazí URL stránky, stiskněte dvakrát pro kopírování.\n\nMicrosoft Outlook 13 nebo novější:\n\nShift+Alt+J – přejde do další složky s nepřečtenými e-maily pod doručenou poštou.\nShift+Ctrl+Alt+I – uloží aktuální složku jako Složku 1\nShift+Alt+I – přejde do Složky 1\n\nLze definovat další 4 složky a přejít do nich. Složky mohou být i v jiném účtu. Gesta jsou stále dostupná.", "sha256": "372c535eaa6795dea1024385d44daac104f9e34de6fcc20cfb467dacc05c68f0", "addonVersionName": "2025.08.13", "addonVersionNumber": {"major": 2025, "minor": 8, "patch": 13}, "minNVDAVersion": {"major": 2019, "minor": 1, "patch": 0}, "lastTestedVersion": {"major": 2025, "minor": 2, "patch": 0}, "channel": "beta", "publisher": "Rainer Brell", "sourceURL": "https://github.com/RainerBrell/robEnhancements/", "license": "GPL v2", "homepage": "https://github.com/rainerbrell/robenhancements/", "licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html", "submissionTime": 1755082050000, "translations": [{"language": "ar", "displayName": "تحسينات ROB", "description": "تضيف هذه الإضافة وظائف جديدة للتطبيقات وتوفر مساعدة عامة:\n\nإذا تم تحديد ملف Markdown (*.md) في مستكشف Windows أو Total Commander:\n\nNVDA+Alt+Space: عرض الملف في متصفح NVDA.\nNVDA+Alt+Shift+Space: حفظ الملف بصيغة HTML.\n\nفي جميع المتصفحات:\n\nNVDA+Ctrl+F4: عرض عنوان URL للصفحة، اضغط مرتين للنسخ إلى الحافظة.\n\nMicrosoft Outlook 13 أو أحدث:\n\nShift+Alt+J: الانتقال إلى المجلد التالي الذي يحتوي على رسائل غير مقروءة أسفل صندوق الوارد.\nShift+Ctrl+Alt+I: حفظ المجلد الحالي كمجلد 1\nShift+Alt+I: الانتقال إلى المجلد 1\n\nيمكن تعريف 4 مجلدات إضافية والتنقل بينها. يمكن أن تكون هذه المجلدات في حساب آخر أيضاً. الإيماءات الخاصة بها لا تزال متاحة."}, {"language": "bg", "displayName": "Подобрения на ROB", "description": "Това разширение добавя нова функционалност към приложенията и предоставя глобална помощ:\n\nАко е избран Markdown файл (*.md) в Windows Explorer или Total Commander:\n\nNVDA+Alt+Space – показва файла в браузъра на NVDA.\nNVDA+Alt+Shift+Space – запазва файла във формат HTML.\n\nВъв всички браузъри:\n\nNVDA+Ctrl+F4 – показва URL на страницата, натиснете два пъти за копиране.\n\nMicrosoft Outlook 13 или по-нова версия:\n\nShift+Alt+J – преминава към следващата папка с непрочетени имейли под входящата поща.\nShift+Ctrl+Alt+I – запазва текущата папка като Папка 1\nShift+Alt+I – преминава към Папка 1\n\nМогат да се зададат още 4 папки и да се преминава към тях. Папките могат да бъдат и в друг акаунт. Жестовете остават свободно достъпни."}, {"language": "cs", "displayName": "Vylepšení ROB", "description": "Toto rozšíření přidává novou funkcionalitu do aplikací a poskytuje globální nápovědu:\n\nPokud je ve Windows Exploreru nebo Total Commanderu vybrán soubor Markdown (*.md):\n\nNVDA+Alt+Mezera – zobrazí soubor v prohlížeči NVDA.\nNVDA+Alt+Shift+Mezera – uloží soubor ve formátu HTML.\n\nVe všech prohlížečích:\n\nNVDA+Ctrl+F4 – zobrazí URL stránky, stiskněte dvakrát pro kopírování.\n\nMicrosoft Outlook 13 nebo novější:\n\nShift+Alt+J – přejde do další složky s nepřečtenými e-maily pod doručenou poštou.\nShift+Ctrl+Alt+I – uloží aktuální složku jako Složku 1\nShift+Alt+I – přejde do Složky 1\n\nLze definovat další 4 složky a přejít do nich. Složky mohou být i v jiném účtu. Gesta jsou stále dostupná."}, {"language": "da", "displayName": "ROB-forbedringer", "description": "Denne udvidelse tilføjer ny funktionalitet til programmer og giver global hjælp:\n\nHvis en Markdown-fil (*.md) er valgt i Stifinder eller Total Commander:\n\nNVDA+Alt+Mellemrum: Vis filen i NVDA-browseren.\nNVDA+Alt+Shift+Mellemrum: Gem filen som HTML.\n\nI alle browsere:\n\nNVDA+Ctrl+F4: Vis side-URL, tryk to gange for at kopiere til udklipsholderen.\n\nMicrosoft Outlook 13 eller nyere:\n\nShift+Alt+J: Gå til næste mappe med ulæste mails under indbakken.\nShift+Ctrl+Alt+I: Gem den aktuelle mappe som Mappe 1\nShift+Alt+I: Gå til Mappe 1\n\nYderligere 4 mapper kan defineres og tilgås. Mapperne kan også være i en anden konto. Gesterne er stadig tilgængelige."}, {"language": "de", "displayName": "ROB Verbesserungen", "description": "Diese Erweiterung fügt Anwendungen neue Funktionen hinzu und stellt neue globale Hilfen bereit:\n\nIst eine Markdown-Datei (*.md) im windows-Explorer oder total Commander ausgewählt:\n\nNVDA+Alt+Leerzeichen, Zeigt die Datei im NVDA-Browser an.\nNVDA+Alt+Umschalt+Leerzeichen, Speichert die Datei im HTML-Format.\n\nIn allen Browsern:\n\nNVDA+Strg+f4, Seiten-URL anzeigen, zweimal drücken, in die Zwischenablage kopieren.\n\nMicrosoft Outlook 13 oder höher:\n\nUmschalt+Alt+j, Springt zum nächsten Ordner mit ungelesenen Mails unterhalb des Ordners Posteingang.\nUmschalt+Strg+Alt+i, Speichert den aktuellen Ordner als Ordner 1\nUmschalt+Alt+i, Gehe zu Ordner 1\n\nEs können weitere 4 Ordner festgelegt und angesprungen werden. Die Ordner können sich auch in einem anderen Konto befinden. Die Gesten dafür sind noch frei zu belegen."}, {"language": "en", "displayName": "ROB enhancements", "description": "This extension adds new functionality to applications and provides new global help:\n\nIf a Markdown file (*.md) is selected in Windows Explorer or total Commander:\n\nNVDA+Alt+Space, Views the file in the NVDA browser.\nNVDA+Alt+Shift+Space, saves the file in HTML format.\n\nIn all browsers:\n\nNVDA+Ctrl+f4, show page URL, press twice, copy to clipboard.\n\nMicrosoft Outlook 13 or later:\n\nShift+Alt+j, Jumps to the next folder with unread emails below the Inbox folder.\nShift+Ctrl+Alt+i, Saves the current folder as Folder 1\nShift+Alt+i, Go to Folder 1\n\nA further 4 folders can be defined and jumped to. The folders can also be in another account. The gestures for this are still freely available."}, {"language": "es", "displayName": "Mejoras ROB", "description": "Esta extensión añade nuevas funcionalidades a las aplicaciones y proporciona nueva ayuda global:\n\nSi se selecciona un archivo Markdown (*.md) en el Explorador de Windows o Total Commander:\n\nNVDA+Alt+Espacio, muestra el archivo en el navegador NVDA.\nNVDA+Alt+Mayús+Espacio, guarda el archivo en formato HTML.\n\nEn todos los navegadores:\n\nNVDA+Ctrl+F4, muestra la URL de la página, presiona dos veces para copiar al portapapeles.\n\nMicrosoft Outlook 13 o posterior:\n\nShift+Alt+J, salta a la siguiente carpeta con correos no leídos debajo de la bandeja de entrada.\nShift+Ctrl+Alt+I, guarda la carpeta actual como Carpeta 1\nShift+Alt+I, ir a la Carpeta 1\n\nSe pueden definir y acceder a otras 4 carpetas. Las carpetas también pueden estar en otra cuenta. Los gestos para esto siguen estando disponibles."}, {"language": "fr", "displayName": "Améliorations ROB", "description": "Cette extension ajoute de nouvelles fonctionnalités aux applications et fournit une aide globale :\n\nSi un fichier Markdown (*.md) est sélectionné dans l'Explorateur Windows ou Total Commander :\n\nNVDA+Alt+Espace, affiche le fichier dans le navigateur NVDA.\nNVDA+Alt+Maj+Espace, enregistre le fichier au format HTML.\n\nDans tous les navigateurs :\n\nNVDA+Ctrl+F4, affiche l'URL de la page, appuyez deux fois pour copier dans le presse-papiers.\n\nMicrosoft Outlook 13 ou version ultérieure :\n\nShift+Alt+J, passe au dossier suivant contenant des courriels non lus sous la boîte de réception.\nShift+Ctrl+Alt+I, enregistre le dossier actuel comme Dossier 1\nShift+Alt+I, aller au Dossier 1\n\nQuatre autres dossiers peuvent être définis et atteints. Les dossiers peuvent également appartenir à un autre compte. Les gestes pour cela restent disponibles."}, {"language": "it", "displayName": "Miglioramenti ROB", "description": "Questa estensione aggiunge nuove funzionalità alle applicazioni e fornisce nuovi aiuti globali:\n\nSe un file Markdown (*.md) è selezionato in Esplora risorse di Windows o in Total Commander:\n\nNVDA+Alt+Spazio, visualizza il file nel browser NVDA.\nNVDA+Alt+Maiusc+Spazio, salva il file in formato HTML.\n\nIn tutti i browser:\n\nNVDA+Ctrl+F4, mostra l'URL della pagina, premi due volte per copiarlo negli appunti.\n\nMicrosoft Outlook 13 o versioni successive:\n\nShift+Alt+J, passa alla prossima cartella con email non lette sotto la posta in arrivo.\nShift+Ctrl+Alt+I, salva la cartella corrente come Cartella 1\nShift+Alt+I, vai alla Cartella 1\n\nÈ possibile definire e raggiungere altre 4 cartelle. Le cartelle possono anche appartenere a un altro account. I gesti per questo sono ancora liberamente disponibili."}, {"language": "nl", "displayName": "ROB-verbeteringen", "description": "Deze extensie voegt nieuwe functionaliteit toe aan toepassingen en biedt globale hulp:\n\nAls een Markdown-bestand (*.md) is geselecteerd in Windows Verkenner of Total Commander:\n\nNVDA+Alt+Spatie: bekijk het bestand in de NVDA-browser.\nNVDA+Alt+Shift+Spatie: sla het bestand op in HTML-formaat.\n\nIn alle browsers:\n\nNVDA+Ctrl+F4: toon pagina-URL, druk tweemaal om te kopiëren naar klembord.\n\nMicrosoft Outlook 13 of later:\n\nShift+Alt+J: spring naar de volgende map met ongelezen e-mails onder de inbox.\nShift+Ctrl+Alt+I: sla de huidige map op als Map 1\nShift+Alt+I: ga naar Map 1\n\nEr kunnen nog 4 extra mappen worden gedefinieerd en benaderd. De mappen kunnen ook in een ander account zitten. De gebaren blijven vrij beschikbaar."}, {"language": "pl", "displayName": "Ulepszenia ROB", "description": "To rozszerzenie dodaje nowe funkcje do aplikacji i zapewnia globalną pomoc:\n\nJeśli w Eksploratorze Windows lub Total Commanderze zaznaczono plik Markdown (*.md):\n\nNVDA+Alt+Spacja — wyświetla plik w przeglądarce NVDA.\nNVDA+Alt+Shift+Spacja — zapisuje plik w formacie HTML.\n\nWe wszystkich przeglądarkach:\n\nNVDA+Ctrl+F4 — pokazuje adres URL strony, naciśnij dwukrotnie, aby skopiować do schowka.\n\nMicrosoft Outlook 13 lub nowszy:\n\nShift+Alt+J — przechodzi do następnego folderu z nieprzeczytanymi wiadomościami poniżej skrzynki odbiorczej.\nShift+Ctrl+Alt+I — zapisuje bieżący folder jako Folder 1\nShift+Alt+I — przechodzi do Folderu 1\n\nMożna zdefiniować kolejne 4 foldery i przechodzić do nich. Foldery mogą również należeć do innego konta. Gesty są nadal dostępne."}, {"language": "pt", "displayName": "Melhorias ROB", "description": "Esta extensão adiciona novas funcionalidades aos aplicativos e fornece ajuda global:\n\nSe um arquivo Markdown (*.md) estiver selecionado no Windows Explorer ou Total Commander:\n\nNVDA+Alt+Espaço, visualiza o arquivo no navegador NVDA.\nNVDA+Alt+Shift+Espaço, salva o arquivo em formato HTML.\n\nEm todos os navegadores:\n\nNVDA+Ctrl+F4, mostra a URL da página, pressione duas vezes para copiar para a área de transferência.\n\nMicrosoft Outlook 13 ou posterior:\n\nShift+Alt+J, vai para a próxima pasta com e-mails não lidos abaixo da caixa de entrada.\nShift+Ctrl+Alt+I, salva a pasta atual como Pasta 1\nShift+Alt+I, vai para a Pasta 1\n\nOutras 4 pastas podem ser definidas e acessadas. As pastas também podem estar em outra conta. Os gestos para isso ainda estão disponíveis."}, {"language": "ru", "displayName": "Дополнения ROB", "description": "Это расширение добавляет новые функции в приложения и предоставляет глобальную справку:\n\nЕсли выбран файл Markdown (*.md) в Проводнике Windows или Total Commander:\n\nNVDA+Alt+Пробел — просмотр файла в браузере NVDA.\nNVDA+Alt+Shift+Пробел — сохранить файл в формате HTML.\n\nВо всех браузерах:\n\nNVDA+Ctrl+F4 — показать URL страницы, нажмите дважды для копирования.\n\nMicrosoft Outlook 13 или новее:\n\nShift+Alt+J — перейти к следующей папке с непрочитанными письмами ниже входящих.\nShift+Ctrl+Alt+I — сохранить текущую папку как Папку 1\nShift+Alt+I — перейти к Папке 1\n\nМожно задать ещё 4 папки и перейти к ним. Папки могут находиться в другой учетной записи. Жесты для этого доступны."}, {"language": "uk", "displayName": "Покращення ROB", "description": "Це розширення додає нові функції до програм і надає глобальну довідку:\n\nЯкщо у Провіднику Windows або Total Commander вибрано файл Markdown (*.md):\n\nNVDA+Alt+Пробіл — перегляд файлу у браузері NVDA.\nNVDA+Alt+Shift+Пробіл — збереження файлу у форматі HTML.\n\nУ всіх браузерах:\n\nNVDA+Ctrl+F4 — показати URL сторінки, натисніть двічі для копіювання.\n\nMicrosoft Outlook 13 або новіший:\n\nShift+Alt+J — перейти до наступної папки з непрочитаними листами нижче вхідних.\nShift+Ctrl+Alt+I — зберегти поточну папку як Папку 1\nShift+Alt+I — перейти до Папки 1\n\nМожна визначити ще 4 папки та переходити до них. Папки можуть бути в іншому обліковому записі. Жести залишаються доступними."}, {"language": "vi", "displayName": "Các cải tiến ROB", "description": "Tiện ích mở rộng này bổ sung chức năng mới cho các ứng dụng và cung cấp trợ giúp toàn cầu:\n\nNếu một tệp Markdown (*.md) được chọn trong Windows Explorer hoặc Total Commander:\n\nNVDA+Alt+Space, hiển thị tệp trong trình duyệt NVDA.\nNVDA+Alt+Shift+Space, lưu tệp ở định dạng HTML.\n\nTrong tất cả các trình duyệt:\n\nNVDA+Ctrl+F4, hiển thị URL trang, nhấn hai lần để sao chép vào bảng tạm.\n\nMicrosoft Outlook 13 trở lên:\n\nShift+Alt+J, chuyển đến thư mục tiếp theo có thư chưa đọc bên dưới hộp thư đến.\nShift+Ctrl+Alt+I, lưu thư mục hiện tại dưới dạng Thư mục 1\nShift+Alt+I, chuyển đến Thư mục 1\n\nCó thể xác định thêm 4 thư mục và chuyển đến chúng. Các thư mục cũng có thể thuộc tài khoản khác. Các tổ hợp phím cho việc này vẫn có sẵn."}]}