{"addonId": "ReminderApp", "displayName": "ReminderApp", "URL": "https://raw.githubusercontent.com/Adriano-Barbieri62/ReminderApp-Addon/main/ReminderApp-2.4.nvda-addon", "description": "Este complemento está diseñado para gestionar recordatorios, citas, aniversarios y cumpleaños de manera original e intuitiva.\nCon ReminderApp, no solo podrás crear y organizar tus recordatorios, sino que también tendrás una libreta de direcciones a mano para tus contactos.\nNVDA+Shift+F1, Detener la alarma en curso.\nNVDA+Shift+F2, Abrir la interfaz gráfica de ReminderApp, si se presiona dos veces, se cerrará.\nNVDA+Shift+F3, Muestra una vista previa del recordatorio del día, si se presiona dos veces, se cerrará.\nPara más instrucciones, también puedes presionar el botón de Ayuda del complemento en el Administrador de complementos.", "sha256": "7224a345881aa12a6347c3375fd65fb383b8bc8fef9d6ed2e9f15286ee57e667", "addonVersionName": "2.4", "addonVersionNumber": {"major": 2, "minor": 4, "patch": 0}, "minNVDAVersion": {"major": 2020, "minor": 1, "patch": 0}, "lastTestedVersion": {"major": 2026, "minor": 1, "patch": 0}, "channel": "beta", "publisher": "Adriano Barbieri", "sourceURL": "https://github.com/Adriano-Barbieri62/ReminderApp-Addon", "license": "GPL v2", "homepage": "https://github.com/Adriano-Barbieri62/ReminderApp-Addon", "licenseURL": "https://www.gnu.org/licenses/gpl-2.0.html", "submissionTime": 1758141961000, "translations": [{"language": "ar", "displayName": "المُذكِّر", "description": "تم تصميم هذا الملحق لإدارة التذكيرات والمواعيد والذكريات السنوية وأعياد الميلاد بطريقة أصلية وبديهية.\nباستخدام ReminderApp، لن تتمكن فقط من إنشاء تذكيراتك وتنظيمها، بل سيكون لديك أيضًا دفتر عناوين لجهات الاتصال في متناول يدك.\nNVDA+Shift+F1، إيقاف التنبيه الجاري.\nNVDA+Shift+F2، فتح واجهة ReminderApp الرسومية، إذا تم الضغط عليه مرتين يتم إغلاقها.\nNVDA+Shift+F3، عرض معاينة لتذكيرات اليوم، وإذا تم الضغط عليه مرتين يتم إغلاقها.\nلمزيد من التعليمات، يمكنك أيضًا الضغط على زر \"مساعدة الملحق\" في مدير الملحقات."}, {"language": "cs", "displayName": "Připomínky", "description": "This add-on is designed to manage reminders, appointments, anniversaries and birthdays in an original and intuitive way.\nWith ReminderApp, you will not only be able to create and organize your reminders, but you will also have a address book at hand for your contacts.\nNVDA+Shift+F1, Stop the ongoing alarm.\nNVDA+Shift+F2, Open the ReminderApp GUI, if pressed 2 times close it.\nNVDA+Shift+F3, shows a preview of the day's reminder, if pressed 2 times close it.\nFor other instructions, you can also press Add-on Help button in Add-ons manager.Tento doplněk je navržen pro správu připomínek, schůzek, výročí a narozenin originálním a intuitivním způsobem.\nS ReminderApp si nejen vytvoříte a uspořádáte připomínky, ale budete mít také po ruce adresář kontaktů.\nNVDA+Shift+F1, Zastaví aktuální alarm.\nNVDA+Shift+F2, Otevře grafické rozhraní ReminderApp, při dvojím stisknutí ho zavře.\nNVDA+Shift+F3, Zobrazí náhled připomínek dne, při dvojím stisknutí ho zavře.\nPro další pokyny můžete také stisknout tlačítko Nápověda doplňku ve správci doplňků."}, {"language": "de", "displayName": "Erinnerungen", "description": "Dieses Add-on wurde entwickelt, um Erinnerungen, Termine, Jahrestage und Geburtstage auf originelle und intuitive Weise zu verwalten.\nMit ReminderApp können Sie nicht nur Ihre Erinnerungen erstellen und organisieren, sondern haben auch ein Adressbuch für Ihre Kontakte zur Hand.\nNVDA+Shift+F1, Stoppt den laufenden Alarm.\nNVDA+Shift+F2, Öffnet die ReminderApp-Oberfläche, bei zweimaligem Drücken wird sie geschlossen.\nNVDA+Shift+F3, Zeigt eine Vorschau der heutigen Erinnerungen, bei erneutem Drücken wird sie geschlossen.\nFür weitere Anweisungen können Sie im Add-on-Manager auch die Schaltfläche „Add-on-Hilfe“ drücken."}, {"language": "en", "displayName": "ReminderApp", "description": "This add-on is designed to manage reminders, appointments, anniversaries and birthdays in an original and intuitive way.\nWith ReminderApp, you will not only be able to create and organize your reminders, but you will also have a address book at hand for your contacts.\nNVDA+Shift+F1, Stop the ongoing alarm.\nNVDA+Shift+F2, Open the ReminderApp GUI, if pressed 2 times close it.\nNVDA+Shift+F3, shows a preview of the day's reminder, if pressed 2 times close it.\nFor other instructions, you can also press Add-on Help button in Add-ons manager."}, {"language": "es", "displayName": "ReminderApp", "description": "Este complemento está diseñado para gestionar recordatorios, citas, aniversarios y cumpleaños de manera original e intuitiva.\nCon ReminderApp, no solo podrás crear y organizar tus recordatorios, sino que también tendrás una libreta de direcciones a mano para tus contactos.\nNVDA+Shift+F1, Detener la alarma en curso.\nNVDA+Shift+F2, Abrir la interfaz gráfica de ReminderApp, si se presiona dos veces, se cerrará.\nNVDA+Shift+F3, Muestra una vista previa del recordatorio del día, si se presiona dos veces, se cerrará.\nPara más instrucciones, también puedes presionar el botón de Ayuda del complemento en el Administrador de complementos."}, {"language": "fr", "displayName": "ReminderApp", "description": "Cette extension est conçue pour gérer les rappels, les rendez-vous, les célébrations et les anniversaires de manière originale et intuitive.\nAvec ReminderApp, vous ne pourrez pas seulement créer et organiser vos rappels, mais vous aurez également un carnet d'adresses à portée de main pour vos contacts.\nNVDA+Shift+F1, Arrêter l'alarme en cours.n\nNVDA+Shift+F2, Ouvrir l'interface graphique de ReminderApp, si appuyé deux fois, la fermer.\nNVDA+Shift+F3, Affiche un aperçu du rappel du jour, si appuyé deux fois, la fermer.\nPour d'autres instructions, vous pouvez également appuyer sur le bouton d'aide de l'extension dans le gestionnaire d'extensions."}, {"language": "hr", "displayName": "Podsjetnik", "description": "Ovaj dodatak je osmišljen za upravljanje podsjetnicima, sastancima, obljetnicama i rođendanima na originalan i intuitivan način.\nS ReminderAppom ne samo da možete stvarati i organizirati svoje podsjetnike, već imate i adresar za kontakte pri ruci.\nNVDA+Shift+F1, Zaustavi trenutni alarm.\nNVDA+Shift+F2, Otvori ReminderApp sučelje; ako se pritisne dvaput, zatvara se.\nNVDA+Shift+F3, Prikazuje pregled današnjih podsjetnika; dvostrukim pritiskom zatvara se.\nZa dodatne upute, možete pritisnuti gumb Pomoć dodatka u upravitelju dodataka."}, {"language": "it", "displayName": "ReminderApp", "description": "Questo componente aggiuntivo è progettato per gestire promemoria, appuntamenti, anniversari e compleanni in modo originale e intuitivo.\nCon ReminderApp non solo potrai creare e organizzare i tuoi promemoria, ma avrai anche una rubrica a portata di mano per i tuoi contatti.\nNVDA+Shift+F1, Ferma l'allarme in corso.\nNVDA+Shift+F2, Apre l'interfaccia grafica di ReminderApp, se premuto due volte la chiude.\nNVDA+Shift+F3, Mostra un'anteprima dei promemoria del giorno, se premuto due volte la chiude.\nPer altre istruzioni, puoi anche premere il pulsante Aiuto componente aggiuntivo nel gestore componenti aggiuntivi."}, {"language": "pt_BR", "displayName": "Lembrete", "description": "Este suplemento foi desenvolvido para gerir lembretes, compromissos, aniversários e datas comemorativas de forma original e intuitiva.\nCom o ReminderApp, poderá não só criar e organizar os seus lembretes, como também terá uma lista de contactos à mão.\nNVDA+Shift+F1, Interrompe o alarme em curso.\nNVDA+Shift+F2, Abre a interface gráfica do ReminderApp; ao pressionar duas vezes, fecha-a.\nNVDA+Shift+F3, Mostra uma pré-visualização dos lembretes do dia; ao pressionar duas vezes, fecha-a.\nPara outras instruções, também pode clicar no botão Ajuda do Suplemento no gestor de suplementos."}, {"language": "pt_PT", "displayName": "Lembrete", "description": "Este suplemento foi desenvolvido para gerir lembretes, compromissos, aniversários e datas comemorativas de forma original e intuitiva.\nCom o ReminderApp, poderá não só criar e organizar os seus lembretes, como também terá uma lista de contactos à mão.\nNVDA+Shift+F1, Interrompe o alarme em curso.\nNVDA+Shift+F2, Abre a interface gráfica do ReminderApp; ao pressionar duas vezes, fecha-a.\nNVDA+Shift+F3, Mostra uma pré-visualização dos lembretes do dia; ao pressionar duas vezes, fecha-a.\nPara outras instruções, também pode clicar no botão Ajuda do Suplemento no gestor de suplementos."}, {"language": "ro", "displayName": "ReminderApp", "description": "Acest supliment este conceput pentru a gestiona mementouri, întâlniri, aniversări și zile de naștere într-un mod original și intuitiv.\nCu ReminderApp, nu doar că poți crea și organiza mementouri, dar ai și o agendă de contacte la îndemână.\nNVDA+Shift+F1, Oprește alarma activă.\nNVDA+Shift+F2, Deschide interfața ReminderApp; dacă este apăsat de două ori, o închide.\nNVDA+Shift+F3, Afișează o previzualizare a mementourilor zilei; dacă este apăsat de două ori, se închide.\nPentru alte instrucțiuni, poți apăsa și butonul de Ajutor al suplimentului din managerul de suplimente."}, {"language": "ru", "displayName": "Reminder App", "description": "Это дополнение предназначено для управления напоминаниями, встречами, годовщинами и днями рождения оригинальным и интуитивно понятным способом.\nС помощью ReminderApp вы сможете не только создавать и организовывать напоминания, но и иметь под рукой адресную книгу контактов.\nNVDA+Shift+F1 — остановить текущий сигнал.\nNVDA+Shift+F2 — открыть графический интерфейс ReminderApp; при двойном нажатии он закрывается.\nNVDA+Shift+F3 — показать предварительный просмотр напоминаний на сегодня; при двойном нажатии закрывается.\nДля получения дополнительных инструкций нажмите кнопку «Справка дополнения"}, {"language": "sk", "displayName": "Pripomienky", "description": "Tento doplnok je navrhnutý na správu pripomienok, stretnutí, výročných udalostí a narodenín originálnym a intuitívnym spôsobom.\nS ReminderApp si budete môcť nielen vytvárať a organizovať pripomienky, ale budete mať po ruke aj adresár pre svoje kontakty.\nNVDA+Shift+F1 – Zastaví prebiehajúci alarm.\nNVDA+Shift+F2 – Otvorí grafické rozhranie ReminderApp; ak sa stlačí dvakrát, zatvorí ho.\nNVDA+Shift+F3 – Zobrazí náhľad pripomienok na daný deň; ak sa stlačí dvakrát, zatvorí ho.\nĎalšie pokyny nájdete aj po stlačení tlačidla Pomocník doplnku v správcovi doplnkov."}, {"language": "tr", "displayName": "Hatırlatıcı", "description": "Bu eklenti, hatırlatıcıları, randevuları, yıldönümlerini ve doğum günlerini orijinal ve sezgisel bir şekilde yönetmek için tasarlanmıştır.\nReminderApp ile sadece hatırlatıcılarınızı oluşturmak ve düzenlemekle kalmaz, aynı zamanda kişileriniz için bir adres defteri de elinizin altında olur.\nNVDA+Shift+F1, Devam eden alarmı durdurur.\nNVDA+Shift+F2, ReminderApp arayüzünü açar; iki kez basıldığında kapatılır.\nNVDA+Shift+F3, Günün hatırlatıcılarının ön izlemesini gösterir; iki kez basıldığında kapatılır.\nDiğer talimatlar için Eklenti Yöneticisi'ndeki Eklenti Yardımı düğmesine de basabilirsiniz."}, {"language": "uk", "displayName": "Додаток для нагадування", "description": "Цей додаток розроблений для керування нагадуваннями, зустрічами, річницями та днями народження в оригінальний і інтуїтивно зрозумілий спосіб.\nЗ ReminderApp ви зможете не лише створювати та організовувати нагадування, але й матимете під рукою адресну книгу для контактів.\nNVDA+Shift+F1 — зупинити поточний сигнал.\nNVDA+Shift+F2 — відкрити графічний інтерфейс ReminderApp; при повторному натисканні — закрити.\nNVDA+Shift+F3 — показати попередній перегляд нагадувань на сьогодні; при повторному натисканні — закрити.\nДля інших інструкцій також можна натиснути кнопку «Довідка про додаток» у менеджері додатків."}]}